import { ISkillsText } from '../../source/interfaces/ISkill';

const skills: ISkillsText = {
  JavaScript:
    'Хорошо знаю основы языка. Умею работать с замыканиями, DOM. Понимаю как устроен Event Loop. Знаю базовые принципы ООП и их реализацию в JS. Умею работать с Promise',
  TypeScript:
    'Умею использовать TypeScript в связке с React для типизации компонентов, пропсов и хуков, так же использую в связке с Redux',
  Bootstrap:
    'Применяю в своих проектах в связке с React. Хорошо понимаю как устроен данный фреймворк и как его правильно использовать',
  i18next:
    'Применяю в своих проектах в связке с React, однако могу использовать и в связке с чистым JS. Умею загружать новые локали из вне',
  ReactRouter: 'Активно использую в своих проектах для маршрутизации',
  Redux:
    'Умею использовать в чистом виде, а так же с дополнениями для Redux. Помимо этого умею использовать Redux Toolkit в связке с AsyncThunk',
  Svelte: 'Понимаю как работать с данным фреймворком для написания реактивных компонентов',
  React:
    'Основной фреймворк (библиотека) на котором я пишу. Могу использовать как классовый, так и функциональный подход',
  Webpack:
    'Умею писать базовую конфигурацию, которой достаточно для запуска проекта в связке с TypeScript и SASS',
  SASS: 'Умею верстать с применением данного препроцессора',
  HTML: 'Понимаю принципы семантики, где какие теги используются, а так же как правильно подключать стили и скрипты',
  CSS: 'Хорошо верстаю с применением Flex и Grid, а так же CSS функций. Знаю как работать с медиа запросами, префиксами и создавать адаптивную верстку',
  NodeJS:
    'Знаю основы построения серверных приложений по архитектуре REST API. Умею работать с различными модулями Node.JS',
  Axios: 'Использую для удобного использования HTTP запросов, но умею работать и с обычным fetch',
  Fedora: 'Основной рабочий дистрибутив, который я использую на дополнительном ПК',
  Figma:
    'Знаю как её использовать для создания простых макетов. В основном применяю для верстки по макету',
  Git: 'Использую исключительно в терминале. Умею делать все базовые операции',
  GitHub:
    'Знаю как использовать Github Actions. В своих проектах всегда пишу простенькие workflow для тестирования',
  Vim: 'Основной текстовый редактор, который я использую когда нет необходимости запускать IDE',
  WebStorm: 'Основная IDE для работы. В ней пишу большую часть времени. Жду появления Fleet',
  ESLint: 'Умею настраивать конфиг, активно использую чтобы следить за качеством своего кода',
  Lodash: 'Утилитарная библиотека, используемая мной при работе со сложными структурами данных',
  Prettier: 'Умею настраивать конфиг, активно использую чтобы следить за качеством своего кода',
  Jest: 'Способен писать простые автоматические тесты',
  Formik: 'Использую для удобной работы с формами',
  Vercel:
    'Основной сервис, используемый мною для деплоя моих проектов. Данное резюме работает на нём',
  Babel: 'Использую в связке с Webpack и TypeScript',
  NPM: 'Базовые операция по установке и удалению пакетов. Настройка простых скриптов',
  Arch: 'Второй Linux дистрибутив, который я использую. Довольно редко отдаю предпочтение именно нему',
  Pug: 'Использую данный препроцессор для упрощения работы с HTML редко, так как чаще всего пишу проекты на React',
};

export default skills;
