export default {
  JavaScript:
    'Написание функциональных компонентов с использованием React Hooks.\n' +
    'Написание реактивных компонентов с использованием ResumeSvelte.\n' +
    'Валидация форм, библиотека yup.\n' +
    'Интернализация текстов, библиотека i18next.\n' +
    'Работа с состоянием приложения, библиотека on-change.\n' +
    'Работа с HTTP, библиотека axios.\n' +
    'Асинхронный код с использованием async/await и Promise.\n' +
    'Базовые знания TypeScript. (Осваиваю)\n' +
    'Настройка конфигурации Webpack для работы с React, ResumeSvelte, Babel, SASS, PostCSS.',
  Node:
    'Создание CLI приложения, библиотека Commander.JS.\n' +
    'Асинхронный код с использованием async/await и Promise.\n' +
    'Работа с HTTP, библиотека axios.',
  Unit:
    'Написание автоматических тестов и дальнейшая интеграция с GitHub для тестирования после каждого коммита. ' +
    'Добавление GitHub Bages на каждый тест в README проекта.',
  CSS:
    'Верстка адаптивных страниц с использованием Flex, Grid и CSS Functions.\n' +
    'Работа с препроцессорами Pug, SASS.\n' +
    'Использование фреймворка Bootstrap.',
  Other:
    'Использование Git в терминале.\n' +
    'Проверка качества кода с помощью ESlint.\n' +
    'Форматирование кода с использованием Prettier.\n' +
    'Написание кода в IDE WebStorm и редакторе Atom.\n' +
    'Работа с макетами в Figma.\n' +
    'Опыт использования дистрибутивов Linux Arch и Fedora.',
};
